{"pageProps":{"project":{"title":"Aagards Glasplader Hacked","slug":"aagaards-glasplader","excerpt":"Aagaards Glasplader is a collection of high-resolution portrait photos from 1857-1880. At Hack4dk 2019 I trained a GAN model to generate new portraits of non-existing people and a text generation model to dream up biographies of the generated people.","coverVideo":"https://vimeo.com/407216870","content":"<p><em>While the digital impacts our mnemonic capacities, historical archives are also digitized affecting how we collectively remember the past. Together with a StyleGAN model, Andreas Refsgaard re-writes our history in the video work Aagaards Glasplader. A generative adversarial network (GAN) is a machine-learning system that can produce an image from a preexisting visual database. From this database, it intercepts patterns and information, after which it can demonstrate its own reverie of the world. Refsgaard has run portrait photos from the mid-19th century through the model, generating new portraits of a non-existing past accompanied by likewise generated historical biographies. It is just plain math, and yet this maneuver can be described as a symbiotic creative process between machine and human. Refsgaard’s work imitates how machine-vision, such as intelligent surveillance cameras and image recognition on social media, detects and analyzes objects, faces, and actions in our everyday surroundings.</em></p>\n<p>Text by Ida Schyum for the online group exhibition Extensions vol. 1 at Radar Contemporary. </p>\n<h2>Behind the project</h2>\n<p>I explain the process and thoughts behind the project in this video from Radar Channel</p>\n<iframe src=\"https://player.vimeo.com/video/423614383?color=ffffff\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen></iframe>\n<h2>Exhibitions</h2>\n<p><a href=\"https://www.radarcontemporary.com/extensionsvol1\">Extensions vol. 1 at Radar Contemporary</a>, Copenhagen/Online 2020, Group Show</p>\n","socialImage":"/assets/images/aagaards_thumb1.jpg","coverImage":"/assets/images/aagaards_thumb1.jpg","details":{"year":"2019","technology":"StyleGAN2, GPT-2, Processing"}}},"__N_SSG":true}