{"pageProps":{"project":{"title":"An algorithm watching a movie trailer","slug":"an-algorithm-watching","excerpt":"We ran the trailer for The Wolf of Wall Street through an object-detection algorithm that identifies and labels everything on screen. In three separate videos, we essentially see how algorithms watch movies: They label the essentials—a tie, a wine glass, a chair—but leave the specifics out. It’s like visual ad-libs.","coverVideo":"https://vimeo.com/508422224","content":"<p>An algorithm watching a movie trailer is a project that tries to explore how an object detection algorithm experiences a movie trailer.\nObject detection is the process of identifying specific objects such as persons, cars and chairs in digital images or video. For most humans this task requires little effort regardless of how the objects may vary in different sizes, scales and rotations or whether they are partially obstructed from view. For long these tasks have been difficult for computers to solve, but recent developments have shown impressive improvements in accuracy and speed, even while detecting multiple objects in the same image.</p>\n<p>We wondered what a fast paced movie trailer would look like seen through the lens of an object detection algorithm. Therefore we sent all individual frames from the movie trailer for The Wolf of Wall Street through Yolo-2 with a threshold of 0.15, meaning that it only reacts to objects detected with a confidence of 15% or higher.</p>\n<h2>Other versions</h2>\n<iframe src=\"https://player.vimeo.com/video/508931696?title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen></iframe>\n<iframe src=\"https://player.vimeo.com/video/508931961?title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen></iframe>\n<h2>Selected Press</h2>\n<p><a href=\"http://sploid.gizmodo.com/watching-an-algorithm-try-to-decode-a-movie-trailer-is-1791288059\">Gizmodo</a></p>\n<p><a href=\"http://www.digitaltrends.com/cool-tech/algorithm-movie-trailers/\">Digital Trends</a></p>\n<p><a href=\"http://www.slate.fr/story/134774/algorithme-reconnaissance-objets\">Slate</a></p>\n","socialImage":"/assets/images/an-algo_thumb1.jpg","coverImage":"/assets/images/an-algo_thumb1.jpg","details":{"year":"2017","technology":"openFrameworks, YOLOv2","flex":{"label":"In collaboration with","value":"Lasse Korsgaard"}}}},"__N_SSG":true}