{"pageProps":{"project":{"title":"Erasing/Enhancing Essentials","slug":"erasing-enhancing-essentials","excerpt":"Erasing/Enhancing Essentials is a project that examines the concept of essence in images by letting algorithms identify and subsequently enhance or erase the most visually important areas of any given image. When exposed to an image a neural network creates a heat map which highlights the areas of the image that are most likely to attract the gaze of a viewer. Using Content-Aware Fill the highlighted areas are either erased, creating uncanny and cold yet evocative scenes, or enhanced, resulting in chaotic dense collages.","content":"<p>When a human eye looks at an image, it quickly focuses on dominant parts of the scene, commonly known as a visual saliency. In other words, visual saliency refers to a set of cognitive procedures that select relevant information and filter out irrelevant information from cluttered visual scenes.</p>\n<p>Erasing/Enhancing Essentials is an ongoing project of mine that investigates essence in images by letting algorithms identify, enhance and erase areas of images that are of the most visual importance. The project uses a Contextual Encoder-Decoder Network for Visual Saliency Prediction. When exposed to a new image the network creates a heat map which highlights the parts of the image most likely to attract the visual attention of a person.</p>\n<p><img src=\"/assets/images/erasing/erasing_1.png\" alt=\"Project photo\" title=\"Project photo\"></p>\n<p>I use this heat map to create a mask containing the most important part(s) or essence of the image. Inside Adobe Photoshop the mask is either used to erase or enhance this “essence”. </p>\n<h3>Erasing essentials</h3>\n<p>In this process the masked area of the image is erased and replaced using Content-Aware Fill in Adobe Photoshop. The results are empty and cold yet evocative settings, where textures, backgrounds and often overlooked parts of images become the core elements and the center of attention.  </p>\n<p><img src=\"/assets/images/erasing/erasing_2.png\" alt=\"Project photo\" title=\"Project photo\"></p>\n<h3>Enhancing essentials</h3>\n<p>In this process the masked area is retained and all other parts of the image are replaced by the “essential parts” using Content-Aware Fill in Adobe Photoshop. The results are dense collages where key elements of the images simultaneously act as background, foreground, patterns and texture chaotically fight for the attention of the viewer. </p>\n<p><img src=\"/assets/images/erasing/erasing_3.png\" alt=\"Project photo\" title=\"Project photo\"></p>\n<h2>Exhibitions</h2>\n<p><a href=\"https://www.icia.se/en/all-exhibitions/manipulations/\">Manipulations @ ICIA</a>, Göteborg/Online 2020, Group Show</p>\n<h2>Visual Saliency Prediction Demo</h2>\n<p><a href=\"https://storage.googleapis.com/msi-net/demo/index.html\">Live webcam demo of visual saliency detection</a> </p>\n<h2>Selected outcomes</h2>\n<p><img src=\"/assets/images/erasing/ex-machina_2_enhanced.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<p><img src=\"/assets/images/erasing/star-trek-first-contact_3_erased.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<p><img src=\"/assets/images/erasing/trump_enhance.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<p><img src=\"/assets/images/erasing/jobs_erase.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n","socialImage":"/assets/images/erasing-enhancing_thumb.jpg","coverImage":"/assets/images/erasing-enhancing_thumb.jpg","details":{"year":"2020","technology":"Tensorflow.js, Adobe Photoshop"}}},"__N_SSG":true}