{"pageProps":{"project":{"title":"Eye Conductor","slug":"eye-conductor","excerpt":"Eye Conductor is a musical interface that allows people with physical disabilities to play music through eye movements and facial gestures. Using a $99 eye tracker and a regular webcam, Eye Conductor detects the gaze and selected facial movements, thereby enabling people to play any instrument, build beats, sequence melodies or trigger musical effects. The system is open, designed for inclusion and can be customised to fit the physical abilities of whoever is using it.","coverVideo":"https://vimeo.com/150125930","content":"<h3>About</h3>\n<p>Eye Conductor is a musical interface that allows people with physical disabilities to play music through eye movements and facial gestures. Using a $99 eye tracker and a regular webcam, Eye Conductor detects the gaze and selected facial movements, thereby enabling people to play any instrument, build beats, sequence melodies or trigger musical effects. The system is open, designed for inclusion and can be customised to fit the physical abilities of whoever is using it.</p>\n<h3>Motivation</h3>\n<p>Imagine playing a musical instrument without using your hands. It can be hard to conceive and even harder to actually do. For a lot of people with physical disabilities the lack of fine motor skills exclude them from producing music on traditional instruments.\nWith Eye Conductor I wanted to push the boundaries of the interaction design by exploring how eye and face tracking technologies could be used for creative purposes. I believe that the ability to express oneself artistically should be available to all, regardless of physical disabilities or challenges. Therefore I wanted to create a solution that operated in the same domain as traditional instruments. Something that gives people a lot of freedom, but also requires them to practice, just like a regular instrument.</p>\n<h3>User research</h3>\n<p>The project relied heavily on user research, and I visited several schools and housing communities for people with physical disabilities, as well as families with children in wheelchairs in their private homes.\nThe people I meet were extremely diverse in terms of physical abilities, but music seemed to be a unifying interest for them all.\nAt Jonstrupvang, a home for people with different disabilities, “Music Thursdays” was the activity that gathers the most people every week, despite the fact that almost half the people doesn’t produce any sound, because of physical inability to do so.\nAbout half of the people I tested early stage prototypes with were unable to speak, but as soon as I showed them my interactive prototypes we immediately connected.</p>\n<h3>Insights</h3>\n<p>From all my user insights the following three stood out:</p>\n<p>1) Regardless of physical abilities music is a major interest, which has the ability to connect people (abled or disabled) through a shared activity.</p>\n<p>2) The ability to create music functions as an important identity marker and a channel for expressing deep emotions, but often requires aid or execution by others.</p>\n<p>3) The technology and the hardware exists, but tools for creating music in real time for people who cannot use their arms and fingers are missing.</p>\n<h3>How Eye Conductor Works</h3>\n<p>Eye Conductor translates eye gaze into musical notes or beats in a drum sequencer. Raising your eyebrows can be used to transpose all played notes up one full octave while opening your mouth can add a delay, reverb or filter effect to the instrument being played. Thresholds for facial gestures can be adjusted and saved to fit the unique abilities of different users.\nEye Conductor is programmed in Processing and early prototypes uses FaceOSC by Kyle McDonald for face tracking.</p>\n<h2>Selected Press Coverage</h2>\n<p><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6752534349276606464/\">Distinguished Design Podcast</a></p>\n<p><a href=\"https://www.newscientist.com/article/2081150-virtual-instruments-let-you-play-music-using-only-your-eyes/\">New Scientist</a></p>\n<p><a href=\"http://www.engadget.com/2016/03/08/eye-conductor-music-maker/\">Engadget</a></p>\n<p><a href=\"http://www.psfk.com/2016/03/play-music-with-eye-movements-facial-gestures-eye-conductor-interaction-design.html\">PSFK</a></p>\n<p><a href=\"http://www.synthtopia.com/content/2016/03/07/eye-conductor-brings-midi-to-people-with-disabilities/\">Synthtopia</a></p>\n<p><a href=\"http://thecreatorsproject.vice.com/blog/eye-conductor-music-maker\">The Creators Project</a></p>\n<p><a href=\"http://motherboard.vice.com/en_ca/read/eye-conductor-helps-the-physically-disabled\">Vice Motherboard</a></p>\n<p><a href=\"http://www.electronicbeats.net/feed/this-interface-helps-disabled-producers-create-music-with-their-eyes/\">Electronic Beats</a></p>\n<p><a href=\"http://prostheticknowledge.tumblr.com/post/140519452291/eye-conductor-student-tech-project-by-andreas\">Prosthetic Knowledge</a></p>\n<p><a href=\"https://www.inverse.com/article/12946-face-the-music-how-the-eye-conductor-help-paralytics-rock-the-fuck-out\">Inverse</a></p>\n<p><a href=\"http://designawards.core77.com/Design-for-Social-Impact/46641/Eye-Conductor\">Core 77</a></p>\n<p><a href=\"http://www.amitele.ca/category/ca-me-regarde/media/lunettes-du-futur\">ÇA ME REGARDE</a></p>\n<h2>Exhibitions</h2>\n<p><a href=\"https://www.instagram.com/p/BLip8WtAEdm/\">Maker Faire Rome – live demo on stage 2016</a>, Rome 2016</p>\n<p>Playful Arts Festival, s-Hertogenbosch 2016</p>\n<h2>Awards</h2>\n<p><a href=\"https://www.instagram.com/p/BQTar56A-Uu/\">IxD Awards Winner (Best Student Project)</a>, 2017</p>\n","socialImage":"/assets/images/eye-conductor_thumb.jpg","coverImage":"/assets/images/eye-conductor_thumb.jpg","details":{"year":"2016","technology":"Processing, FaceOSC, Ableton"}}},"__N_SSG":true}