{"pageProps":{"project":{"title":"Eyerizon","slug":"eyerizon","excerpt":"Applying speculative and user-centered design principles to complex issues involving social isolation and aging.","coverVideo":"https://vimeo.com/158555045","content":"<p>Eyerizon is an example of applying speculative and user-centered design principles to complex issues involving social isolation and aging.\nOtto is 93-years old and lives in an assisted living center. His mind is as clear as ever yet physical ailments make it increasingly difficult to move without assistance. He has created a new home in his studio apartment, yet he is having difficulty adjusting to the transition at this stage in his life. Despite being amongst people his own age and in similar situations, he has no real friends at the assisted living center and has no one to talk to about his lifelong passion for art, literature and design.</p>\n<p>After carrying out some rapid design research with Otto and others like him, the team concluded that simply increasing social interaction was not the problem – caring staff and fellow residents surrounded people in Otto’s situation. What Otto really struggled with was finding opportunities to engage in the activities that shaped his personal identity throughout his life.\nThe answer lies with maintaining a sense of self and independence.</p>\n<h3>Speculative concept</h3>\n<p>Eyerizon is a speculative design concept set in the not too distant future. By 2030, it is projected that newborn children in developed countries will have a life expectancy of 130 years. Couple this startling prediction with the rapid advancement in and proliferation of web-connected video and medical devices – the number of which will soon exceed the global population – and we see radically different kinds of solutions needed for reducing social isolation in the aging.</p>\n<p>Eyerizon is a product and service that allows people like Otto to maintain a sense of independence, presence and productivity out in the world, once mobility issues limit his ability to leave his home. The team used video prototyping to explore questions around “static” and “virtual” mobility, social interaction, and the changing role of age in a knowledge economy. These themes are reflected in the four areas that remain important to Otto’s personal identity: Leisure, work, family and social life.</p>\n<h3>Process as prototype</h3>\n<p>The CIID team – Andreas, Melina and Chelsey – first met Otto during a tour of the assisted living center where he lives in Copenhagen. It was soon evident that this was the beginning of a rich collaboration.\nAfter initial design research and a series of future casting exercises, the team prototyped concepts in the community to raise questions around identity, the sharing economy and its limits, and the notion of physical presence.</p>\n<p>Eyerizon came from looking at the problem from the perspective of Otto and people like him, who were seeking outlets to express their individuality. It felt only natural to add Otto to the team and engage him with crafting the final design. The team, including Otto, developed the script, created the prototypes and shot the concept video over the course of two days.</p>\n","socialImage":"/assets/images/eyerizon_thumb1.jpg","coverImage":"/assets/images/eyerizon_thumb1.jpg","details":{"year":"2015","technology":"Video","flex":{"label":"In collaboration with","value":"Chelsey Wickmark & Melina Pykkönen"}}}},"__N_SSG":true}