{"pageProps":{"project":{"title":"Human-Tree-Machine","slug":"human-tree-machine","excerpt":"Collaborative interactive installation that plunges into the speculative and problematic scenario of being able to chat with a one of the festival sites permanent residents: a 40 year old chestnut tree","content":"<p>For the first time, in the history of Roskilde Festival it is possible to enter the judge tower of Roskilde’s agricultural show. Laboratory for Aesthetics and Ecology has gathered a strong multidisciplinary team of programmers, biologists and artists, who have collectively built an immersive, interactive installation in the judge tower.</p>\n<p>Curated by Laboratory for Aesthetics and Ecology and Roskilde Festival.</p>\n<p>Human-Tree-Machine was a multidisciplinary and trans-species collaboration shown at Roskilde Festival 2017.</p>\n<p>In the room, festival goers will meet a setting in which trees and machines have grown into each other. Lights and images are projected on a construction of hardware, bark, cables, lichens, mosses, LED-panels, and microorganisms. A human guest is invited to participate by writing and conversing with a tree nearby through a chat interface. The entire installation is modified in real-time according to impulses sent by the tree via a bio-sensor-network.</p>\n<p>My role in this project was to build the chatbot and the visual chatbot interface as well as determine the logic for how the tree would change its conversation patterns based on sensor input.</p>\n<p>Made in collaboration with: Martin Malthe Borch, Elena Lundqvist Ortíz, Naja Ryde Ankarfeldt, Peter Hjetting, Johan Pedersen, André Hansen, Lasse Korsgaard, Kasper Holm &#x26; Line Kjær.</p>\n<p><img src=\"/assets/images/human-tree_1.jpg\" alt=\"Photo from installation at Roskilde Festival\" title=\"Photo from installation at Roskilde Festival\"></p>\n<h2>Exhibitions</h2>\n<p><a href=\"http://www.labae.org/roskilde-festival-17\">Roskilde Festival</a>, Roskilde 2017</p>\n","socialImage":"/assets/images/human-tree_1.jpg","coverImage":"/assets/images/human-tree_1.jpg","details":{"year":"2017","technology":"JavaScript, RiveScript"}}},"__N_SSG":true}