{"pageProps":{"project":{"title":"In Algorithms We Trust","slug":"in_algorithms","excerpt":"The art piece In Algorithms We Trust invites guests of Roskilde Festival to reflect upon the role of software algorithms while also providing an opportunity to pose a question to Chelsea Manning.","coverVideo":"https://vimeo.com/310553909","content":"<p>Software algorithms are all around us, increasingly controlling aspects of our lives by making decisions independent of human interference. Since they are based on training data or abstract rules rather than feelings and needs, algorithms are often regarded to be more trustworthy and objective compared to human beings.</p>\n<p>The art piece In Algorithms We Trust invites guests of Roskilde Festival to reflect upon the role of software algorithms while also providing an opportunity to pose a question to Chelsea Manning.</p>\n<p>Guests are asked to answer a series of questions about themselves and subsequently upload their portrait photo before they can be allowed to pose a question to Chelsea Manning. In the background an algorithm is silently judging the credibility of each guest by comparing their answers to data deduced from the person’s uploaded portrait photo via a machine learning model that is able to estimate the age, gender, mood, and visual appearance of each guest based on a single photo. The algorithm accepts the model’s estimates as true and views guests as trustworthy only to the extent that their testimonies about themselves correlate with the estimates of the model.</p>\n<p>In the end, a handful of the guests considered to be the most trustworthy by the algorithm will be allowed to pose a question for Chelsea Manning during her talk at Gloria Stage, Thursday 5th of July 15:30 CET 2018.</p>\n<h2>Exhibitions</h2>\n<p><a href=\"https://www.roskilde-festival.dk/media/1750/rf-arts-pressekit-2018-26-06-2018.pdf\">Roskilde Festival</a>, Roskilde 2018</p>\n<h2>Microsoft Face API results</h2>\n<iframe src=\"https://player.vimeo.com/video/310554002?title=0&byline=0&portrait=0\" width=\"640\" height=\"400\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen></iframe>\n","socialImage":"/assets/images/in-algo_thumb.jpg","coverImage":"/assets/images/in-algo_thumb.jpg","details":{"year":"2018","technology":"Microsoft Azure Face, Web Technologies'"}}},"__N_SSG":true}