{"pageProps":{"project":{"title":"Poems About Things","slug":"poems-about-things","excerpt":"Poems About Things is a project that generates poetry from everyday objects around us. It consists of a mobile website that constructs quirky sentences about the objects it sees through the users camera feed.","coverVideo":"https://vimeo.com/316109907","content":"<p>Poems About Things is a project that generates poetry from everyday objects around us. It consists of a mobile website that constructs quirky sentences about the objects it sees through the users camera feed.</p>\n<p>As the user's camera focuses on an object, a built in machine learning model gives its best guess as to what object it is seeing. Based on this estimate a short query is sent to Google Suggest API, which in return sends back a list of sentences inspired by the detected object. The poem appears on the screen overlaying the image of the object. It consists of a handful of sentences expressing thoughts, questions or comments related to the immediate object as well as the bigger world outside it.</p>\n<p><img src=\"/assets/images/poems_full.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<h3>Google Suggest</h3>\n<p>On average more than 3.5 billion daily searches are performed on Google around the world. Google Suggest works by attempting to complete users search queries by providing a list of the sentences most searched for on Google. A number of other factors such as location, search history and trending terms also affect the algorithm and determine the order of suggestions. Finally censorship prevents (at least to some extent) hateful, pornographic, piracy-related and some other controversial queries to be suggested.\nHence Poems About Things provides a unique insight into the aggregated human behind common Google search queries, reflecting the topics that mankind as a whole seems interested in and the big and small problems we face.</p>\n<h3>Starting the searches with specific words</h3>\n<p>In order to make the results from Google Suggest a bit more personal and interesting each detected object is preceded by one or two words starting points from the following list: “my”, “this”, “does”, “is my”, “does my”, “why can”, “which”, “why are”, “what”, “where”, “can”, “help”, “does”, “that”</p>\n<h3>Trimming the results</h3>\n<p>To avoid certain types of results I manually created a list containing like: “meme”, “memes”, “lyric”, “lyrics”, “chord”, “chords”, “imdb”, “movie”, “movies”, “cast”, “quotes” etc. If a sentence contained one or more of these words, it is omitted from the final poem.</p>\n<h2>Selected outputs</h2>\n<p><img src=\"/assets/images/poems_organ.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<p><img src=\"/assets/images/poems_banana.jpg\" alt=\"Project photo\" title=\"Project photo\"></p>\n<h2>Press</h2>\n<p><a href=\"https://kunsten.nu/journal/netkunst-i-en-krisetid/\">Kunsten.nu</a></p>\n<p><a href=\"https://demagsign.io/what-happens-when-ai-writes-a-novel/\">DeMagSign</a></p>\n<p><a href=\"https://stars.library.ucf.edu/cgi/viewcontent.cgi?article=1124&#x26;context=elo2020\">Digital Literature in Danish Public Libraries</a></p>\n<h2>Exhibitions</h2>\n<p><a href=\"https://www.mu.nl/files/MU_The_Object_Is_Absent_EN.pdf-566472.pdf\">The object is Absent</a>, MU Eindhoven 2019</p>\n<p><a href=\"https://koegenu.dk/details-page/news/skab-digital-litteratur.58353\">Skab Digital Litteratur</a>, Køge Bibliotek 2019</p>\n<h2>Demo</h2>\n<p><a href=\"https://editor.p5js.org/AndreasRef/present/pglTkcFO7\">Try out the project here</a> </p>\n","socialImage":"/assets/images/poems_thumb_2.jpg","coverImage":"/assets/images/poems_thumb_2.jpg","details":{"year":"2019","technology":"ml5.js, p5.js, Google Suggest API"}}},"__N_SSG":true}