{"pageProps":{"project":{"title":"Sound Blocks","slug":"sounds-blocks","excerpt":"Sound Blocks is a tool designed to teach children and adults what sound is made of. The project was shortlisted in the Expression category of the IXDA Interaction Awards and it was developed by John Ferreira, Alejandra Molina, Andreas Refsgaard at the CIID using Arduino.","coverVideo":"https://vimeo.com/125520418","content":"<h3>What is sound made of?</h3>\n<p>It’s a question that seems simple, but as we all know the simplest things sometimes hide wonderful complexity. The challenge was taken first to understand what factors and aspects sound is created from. There are a lot factors, too many to be conveyed through language alone, in a short period of time. So the team created Sound Blocks, which allows people to learn how with a few parameters we can create new sounds, and, if desired, imitate real world sounds. It does this by letting the user control waveform, sound decay or wave length and volume of three channels, all mixed together. Sound blocks first and foremost was created as a tool to experiment with sound, it is playful and engaging. The goal is to help children and people of all ages better understand the basic elements that make up a sound.</p>\n<h3>How does it work?</h3>\n<p>You are given three channels to experiment with. You can pick a basic waveform, the duration of the wave, and adjust the volume of each channel. It allows you to understand how synthesizers can emulate real world sounds,such as drums or a keyboard, with simple example recipes to get you started quickly. The team’s learnings were plentiful. They learnt a great deal about what sound is and the factors that make sound and musical sound exist. On the physical computing side they learnt about circuitry and using resistances to differentiate objects. Each block has its own resistance value and thus can be used to trigger an exact reaction on another software, which in this case is Ableton Live. Coding skills were also required to identify, transform and send the signals into the sound software.</p>\n<h2>Awards</h2>\n<p><a href=\"https://www.youfab.info/2019/winners/sound-blocks\">YouFab Global Creative Awards</a> 2019</p>\n<p><a href=\"https://awards.ixda.org/2016-interaction-awards/\">IxD Awards finalist (Expression Category)</a> 2016</p>\n<h2>Press</h2>\n<p><a href=\"http://makezine.com/2016/03/18/learning-what-sounds-are-made-of-using-sound-blocks/\">Makezine.nu</a></p>\n<p><a href=\"https://blog.arduino.cc/2016/03/16/discover-what-sound-is-made-of-with-sound-block/\">Arduino Blog</a></p>\n<h2>Exhibitions</h2>\n<p><a href=\"http://ciid.dk/trailer-park-festivals-io-exhibition/\">TrailerPark IO 2015</a>, Copenhagen 2015</p>\n","socialImage":"/assets/images/sound-blocks_thumb1.jpg","coverImage":"/assets/images/sound-blocks_thumb1.jpg","details":{"year":"2015","technology":"Arduino, Processing, Ableton","flex":{"label":"In collaboration with","value":" John Ferreira & Alejandra Molina"}}}},"__N_SSG":true}